{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/stack/3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"64"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/stack/3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"1"}]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/mul/y","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/stack/3","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"2"},{"size":"2"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"1"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_2/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"128"}]}}}},"name":"Model/U-Net/conv_2/convolution_2_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_2/convolution_2_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_2/convolution_2_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_2/convolution_2_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"512"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"512"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"512"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"512"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"256"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_2/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"256"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"128"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/bias","op":"Const"},{"input":[],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}}},"name":"Model/U-Net/conv_transpose_3/concat_3/axis","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"128"},{"size":"64"}]}}}},"name":"Model/U-Net/conv_transpose_1/convolution_1_1/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_1/convolution_1_1/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"},{"size":"2"}]}}},"dtype":{"type":3}},"name":"Model/U-Net/conv_1/Pad/paddings","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"3"},{"size":"3"},{"size":"64"},{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_1/convolution_1_2/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"64"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/conv_transpose_1/convolution_1_2/bias","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[{"size":"1"},{"size":"1"},{"size":"64"},{"size":"2"}]}}},"dtype":{"type":1}},"name":"Model/U-Net/deconv_final/convolution_1_final/kernel","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}},"dtype":{"type":3}},"name":"Model/JS/Output/dimension","op":"Const"},{"input":[],"attr":{"dtype":{"type":1},"shape":{"shape":{"dim":[{"size":"-1"},{"size":"64"},{"size":"64"}]}}},"name":"Placeholder","op":"Placeholder"},{"input":["^Placeholder"],"attr":{"dtype":{"type":3},"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[]}}}},"name":"ConstantFolding/Model/Inputs/stack_const_axis","op":"Const"},{"input":["Placeholder","ConstantFolding/Model/Inputs/stack_const_axis"],"attr":{"T":{"type":1},"Tdim":{"type":3}},"name":"Model/Inputs/stack","op":"ExpandDims"},{"input":["Model/Inputs/stack","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_1/Pad","op":"Pad"},{"input":["Model/U-Net/conv_1/Pad","Model/U-Net/conv_1/convolution_1_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_1/convolution_1_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_1/convolution_1_1/Conv2D","Model/U-Net/conv_1/convolution_1_1/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_1/convolution_1_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_1/convolution_1_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_1/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_1/Pad_1","Model/U-Net/conv_1/convolution_1_2/kernel"],"attr":{"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_1/convolution_1_2/Conv2D","Model/U-Net/conv_1/convolution_1_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_1/convolution_1_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_1/convolution_1_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_1/convolution_1_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_1/convolution_1_2/Relu"],"attr":{"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"Model/U-Net/conv_1/max_pooling2d/MaxPool","op":"MaxPool"},{"input":["Model/U-Net/conv_1/max_pooling2d/MaxPool","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_2/Pad","op":"Pad"},{"input":["Model/U-Net/conv_2/Pad","Model/U-Net/conv_2/convolution_2_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_2/convolution_2_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_2/convolution_2_1/Conv2D","Model/U-Net/conv_2/convolution_2_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_2/convolution_2_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_2/convolution_2_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_2/convolution_2_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_2/convolution_2_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_2/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_2/Pad_1","Model/U-Net/conv_2/convolution_2_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_2/convolution_2_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_2/convolution_2_2/Conv2D","Model/U-Net/conv_2/convolution_2_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_2/convolution_2_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_2/convolution_2_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_2/convolution_2_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_2/convolution_2_2/Relu"],"attr":{"padding":{"s":[86,65,76,73,68]},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"Model/U-Net/conv_2/max_pooling2d/MaxPool","op":"MaxPool"},{"input":["Model/U-Net/conv_2/max_pooling2d/MaxPool","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_3/Pad","op":"Pad"},{"input":["Model/U-Net/conv_3/Pad","Model/U-Net/conv_3/convolution_3_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_3/convolution_3_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_3/convolution_3_1/Conv2D","Model/U-Net/conv_3/convolution_3_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_3/convolution_3_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_3/convolution_3_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_3/convolution_3_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_3/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_3/Pad_1","Model/U-Net/conv_3/convolution_3_2/kernel"],"attr":{"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_3/convolution_3_2/Conv2D","Model/U-Net/conv_3/convolution_3_2/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_3/convolution_3_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_3/convolution_3_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_3/convolution_3_2/Relu"],"attr":{"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"ksize":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"padding":{"s":[86,65,76,73,68]},"T":{"type":1}},"name":"Model/U-Net/conv_3/max_pooling2d/MaxPool","op":"MaxPool"},{"input":["Model/U-Net/conv_3/max_pooling2d/MaxPool","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_middle/Pad","op":"Pad"},{"input":["Model/U-Net/conv_middle/Pad","Model/U-Net/conv_middle/convolution_middle_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_middle/convolution_middle_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_middle/convolution_middle_1/Conv2D","Model/U-Net/conv_middle/convolution_middle_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_middle/convolution_middle_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_middle/convolution_middle_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_middle/convolution_middle_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_middle/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_middle/Pad_1","Model/U-Net/conv_middle/convolution_middle_2/kernel"],"attr":{"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_middle/convolution_middle_2/Conv2D","Model/U-Net/conv_middle/convolution_middle_2/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_middle/convolution_middle_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_middle/convolution_middle_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_middle/convolution_middle_2/Relu"],"attr":{"T":{"type":1},"out_type":{"type":3}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/Shape","op":"Shape"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"Index":{"type":3},"T":{"type":3},"shrink_axis_mask":{"i":"1"},"begin_mask":{"i":"0"},"ellipsis_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/strided_slice","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"T":{"type":3},"Index":{"type":3},"shrink_axis_mask":{"i":"1"},"ellipsis_mask":{"i":"0"},"begin_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/strided_slice_1","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"shrink_axis_mask":{"i":"1"},"ellipsis_mask":{"i":"0"},"begin_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/strided_slice_2","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/strided_slice_1","Model/U-Net/conv_transpose_1/up-convolution_1/mul/y"],"attr":{"T":{"type":3}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/mul","op":"Mul"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/strided_slice_2","Model/U-Net/conv_transpose_1/up-convolution_1/mul/y"],"attr":{"T":{"type":3}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/mul_1","op":"Mul"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/strided_slice","Model/U-Net/conv_transpose_3/up-convolution_3/mul","Model/U-Net/conv_transpose_3/up-convolution_3/mul_1","Model/U-Net/conv_transpose_3/up-convolution_3/stack/3"],"attr":{"T":{"type":3},"axis":{"i":"0"},"N":{"i":"4"}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/stack","op":"Pack"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/stack","Model/U-Net/conv_transpose_3/up-convolution_3/kernel","Model/U-Net/conv_middle/convolution_middle_2/Relu"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/conv2d_transpose","op":"Conv2DBackpropInput"},{"input":["Model/U-Net/conv_transpose_3/up-convolution_3/conv2d_transpose","Model/U-Net/conv_transpose_3/up-convolution_3/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_transpose_3/up-convolution_3/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_3/convolution_3_2/Relu","Model/U-Net/conv_transpose_3/up-convolution_3/BiasAdd","Model/U-Net/conv_transpose_3/concat_3/axis"],"attr":{"Tidx":{"type":3},"T":{"type":1},"N":{"i":"2"}},"name":"Model/U-Net/conv_transpose_3/concat_3","op":"ConcatV2"},{"input":["Model/U-Net/conv_transpose_3/concat_3","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_transpose_3/Pad","op":"Pad"},{"input":["Model/U-Net/conv_transpose_3/Pad","Model/U-Net/conv_transpose_3/convolution_3_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_transpose_3/convolution_3_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_transpose_3/convolution_3_1/Conv2D","Model/U-Net/conv_transpose_3/convolution_3_1/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_transpose_3/convolution_3_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_transpose_3/convolution_3_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_transpose_3/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_transpose_3/Pad_1","Model/U-Net/conv_transpose_3/convolution_3_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_transpose_3/convolution_3_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_transpose_3/convolution_3_2/Conv2D","Model/U-Net/conv_transpose_3/convolution_3_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_transpose_3/convolution_3_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_transpose_3/convolution_3_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_transpose_3/convolution_3_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_transpose_3/convolution_3_2/Relu"],"attr":{"T":{"type":1},"out_type":{"type":3}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/Shape","op":"Shape"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"shrink_axis_mask":{"i":"1"},"begin_mask":{"i":"0"},"ellipsis_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/strided_slice","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3},"shrink_axis_mask":{"i":"1"},"ellipsis_mask":{"i":"0"},"begin_mask":{"i":"0"}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/strided_slice_1","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"Index":{"type":3},"T":{"type":3},"shrink_axis_mask":{"i":"1"},"ellipsis_mask":{"i":"0"},"begin_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/strided_slice_2","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/strided_slice_1","Model/U-Net/conv_transpose_1/up-convolution_1/mul/y"],"attr":{"T":{"type":3}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/mul","op":"Mul"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/strided_slice_2","Model/U-Net/conv_transpose_1/up-convolution_1/mul/y"],"attr":{"T":{"type":3}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/mul_1","op":"Mul"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/strided_slice","Model/U-Net/conv_transpose_2/up-convolution_2/mul","Model/U-Net/conv_transpose_2/up-convolution_2/mul_1","Model/U-Net/conv_transpose_2/up-convolution_2/stack/3"],"attr":{"T":{"type":3},"axis":{"i":"0"},"N":{"i":"4"}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/stack","op":"Pack"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/stack","Model/U-Net/conv_transpose_2/up-convolution_2/kernel","Model/U-Net/conv_transpose_3/convolution_3_2/Relu"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/conv2d_transpose","op":"Conv2DBackpropInput"},{"input":["Model/U-Net/conv_transpose_2/up-convolution_2/conv2d_transpose","Model/U-Net/conv_transpose_2/up-convolution_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_transpose_2/up-convolution_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_2/convolution_2_2/Relu","Model/U-Net/conv_transpose_2/up-convolution_2/BiasAdd","Model/U-Net/conv_transpose_3/concat_3/axis"],"attr":{"T":{"type":1},"N":{"i":"2"},"Tidx":{"type":3}},"name":"Model/U-Net/conv_transpose_2/concat_2","op":"ConcatV2"},{"input":["Model/U-Net/conv_transpose_2/concat_2","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_transpose_2/Pad","op":"Pad"},{"input":["Model/U-Net/conv_transpose_2/Pad","Model/U-Net/conv_transpose_2/convolution_2_1/kernel"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true}},"name":"Model/U-Net/conv_transpose_2/convolution_2_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_transpose_2/convolution_2_1/Conv2D","Model/U-Net/conv_transpose_2/convolution_2_1/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_transpose_2/convolution_2_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_transpose_2/convolution_2_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_transpose_2/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_transpose_2/Pad_1","Model/U-Net/conv_transpose_2/convolution_2_2/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_transpose_2/convolution_2_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_transpose_2/convolution_2_2/Conv2D","Model/U-Net/conv_transpose_2/convolution_2_2/bias"],"attr":{"data_format":{"s":[78,72,87,67]},"T":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_transpose_2/convolution_2_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_transpose_2/convolution_2_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_transpose_2/convolution_2_2/Relu"],"attr":{"T":{"type":1},"out_type":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/Shape","op":"Shape"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"shrink_axis_mask":{"i":"1"},"begin_mask":{"i":"0"},"ellipsis_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"T":{"type":3},"Index":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"shrink_axis_mask":{"i":"1"},"ellipsis_mask":{"i":"0"},"begin_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/Shape","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2/stack_1","Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1"],"attr":{"ellipsis_mask":{"i":"0"},"begin_mask":{"i":"0"},"new_axis_mask":{"i":"0"},"end_mask":{"i":"0"},"Index":{"type":3},"T":{"type":3},"shrink_axis_mask":{"i":"1"}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2","op":"StridedSlice"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1","Model/U-Net/conv_transpose_1/up-convolution_1/mul/y"],"attr":{"T":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/mul","op":"Mul"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2","Model/U-Net/conv_transpose_1/up-convolution_1/mul/y"],"attr":{"T":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/mul_1","op":"Mul"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice","Model/U-Net/conv_transpose_1/up-convolution_1/mul","Model/U-Net/conv_transpose_1/up-convolution_1/mul_1","Model/U-Net/conv_transpose_1/up-convolution_1/stack/3"],"attr":{"axis":{"i":"0"},"N":{"i":"4"},"T":{"type":3}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/stack","op":"Pack"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/stack","Model/U-Net/conv_transpose_1/up-convolution_1/kernel","Model/U-Net/conv_transpose_2/convolution_2_2/Relu"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"strides":{"list":{"s":[],"i":["1","2","2","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"data_format":{"s":[78,72,87,67]},"use_cudnn_on_gpu":{"b":true}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/conv2d_transpose","op":"Conv2DBackpropInput"},{"input":["Model/U-Net/conv_transpose_1/up-convolution_1/conv2d_transpose","Model/U-Net/conv_transpose_1/up-convolution_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_transpose_1/up-convolution_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_1/convolution_1_2/Relu","Model/U-Net/conv_transpose_1/up-convolution_1/BiasAdd","Model/U-Net/conv_transpose_3/concat_3/axis"],"attr":{"T":{"type":1},"N":{"i":"2"},"Tidx":{"type":3}},"name":"Model/U-Net/conv_transpose_1/concat_1","op":"ConcatV2"},{"input":["Model/U-Net/conv_transpose_1/concat_1","Model/U-Net/conv_1/Pad/paddings"],"attr":{"T":{"type":1},"Tpaddings":{"type":3}},"name":"Model/U-Net/conv_transpose_1/Pad","op":"Pad"},{"input":["Model/U-Net/conv_transpose_1/Pad","Model/U-Net/conv_transpose_1/convolution_1_1/kernel"],"attr":{"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]}},"name":"Model/U-Net/conv_transpose_1/convolution_1_1/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_transpose_1/convolution_1_1/Conv2D","Model/U-Net/conv_transpose_1/convolution_1_1/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_transpose_1/convolution_1_1/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_transpose_1/convolution_1_1/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_transpose_1/convolution_1_1/Relu","op":"Relu"},{"input":["Model/U-Net/conv_transpose_1/convolution_1_1/Relu","Model/U-Net/conv_1/Pad/paddings"],"attr":{"Tpaddings":{"type":3},"T":{"type":1}},"name":"Model/U-Net/conv_transpose_1/Pad_1","op":"Pad"},{"input":["Model/U-Net/conv_transpose_1/Pad_1","Model/U-Net/conv_transpose_1/convolution_1_2/kernel"],"attr":{"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true}},"name":"Model/U-Net/conv_transpose_1/convolution_1_2/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/conv_transpose_1/convolution_1_2/Conv2D","Model/U-Net/conv_transpose_1/convolution_1_2/bias"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]}},"name":"Model/U-Net/conv_transpose_1/convolution_1_2/BiasAdd","op":"BiasAdd"},{"input":["Model/U-Net/conv_transpose_1/convolution_1_2/BiasAdd"],"attr":{"T":{"type":1}},"name":"Model/U-Net/conv_transpose_1/convolution_1_2/Relu","op":"Relu"},{"input":["Model/U-Net/conv_transpose_1/convolution_1_2/Relu","Model/U-Net/deconv_final/convolution_1_final/kernel"],"attr":{"T":{"type":1},"data_format":{"s":[78,72,87,67]},"strides":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}},"use_cudnn_on_gpu":{"b":true},"padding":{"s":[86,65,76,73,68]},"dilations":{"list":{"s":[],"i":["1","1","1","1"],"f":[],"b":[],"type":[],"shape":[],"tensor":[],"func":[]}}},"name":"Model/U-Net/deconv_final/convolution_1_final/Conv2D","op":"Conv2D"},{"input":["Model/U-Net/deconv_final/convolution_1_final/Conv2D","Model/JS/Output/dimension"],"attr":{"output_type":{"type":9},"Tidx":{"type":3},"T":{"type":1}},"name":"Model/JS/Output","op":"ArgMax"}],"library":{"function":[],"gradient":[]},"versions":{"badConsumers":[]}},"weightsManifest":[{"weights":[{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/stack/3","dtype":"int32","shape":[]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/kernel","dtype":"float32","shape":[2,2,64,128]},{"name":"Model/U-Net/conv_transpose_2/up-convolution_2/stack/3","dtype":"int32","shape":[]},{"name":"Model/U-Net/conv_transpose_2/up-convolution_2/kernel","dtype":"float32","shape":[2,2,128,256]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack","dtype":"int32","shape":[1]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_1/stack_1","dtype":"int32","shape":[1]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice_2/stack_1","dtype":"int32","shape":[1]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/strided_slice/stack_1","dtype":"int32","shape":[1]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/mul/y","dtype":"int32","shape":[]},{"name":"Model/U-Net/conv_transpose_3/up-convolution_3/stack/3","dtype":"int32","shape":[]},{"name":"Model/U-Net/conv_transpose_3/up-convolution_3/kernel","dtype":"float32","shape":[2,2,256,512]},{"name":"Model/U-Net/conv_1/convolution_1_1/kernel","dtype":"float32","shape":[3,3,1,64]},{"name":"Model/U-Net/conv_1/convolution_1_1/bias","dtype":"float32","shape":[64]},{"name":"Model/U-Net/conv_1/convolution_1_2/kernel","dtype":"float32","shape":[3,3,64,64]},{"name":"Model/U-Net/conv_1/convolution_1_2/bias","dtype":"float32","shape":[64]},{"name":"Model/U-Net/conv_2/convolution_2_1/kernel","dtype":"float32","shape":[3,3,64,128]},{"name":"Model/U-Net/conv_2/convolution_2_1/bias","dtype":"float32","shape":[128]},{"name":"Model/U-Net/conv_2/convolution_2_2/kernel","dtype":"float32","shape":[3,3,128,128]},{"name":"Model/U-Net/conv_2/convolution_2_2/bias","dtype":"float32","shape":[128]},{"name":"Model/U-Net/conv_3/convolution_3_1/kernel","dtype":"float32","shape":[3,3,128,256]},{"name":"Model/U-Net/conv_3/convolution_3_1/bias","dtype":"float32","shape":[256]},{"name":"Model/U-Net/conv_3/convolution_3_2/kernel","dtype":"float32","shape":[3,3,256,256]},{"name":"Model/U-Net/conv_3/convolution_3_2/bias","dtype":"float32","shape":[256]},{"name":"Model/U-Net/conv_middle/convolution_middle_1/kernel","dtype":"float32","shape":[3,3,256,512]},{"name":"Model/U-Net/conv_middle/convolution_middle_1/bias","dtype":"float32","shape":[512]},{"name":"Model/U-Net/conv_middle/convolution_middle_2/kernel","dtype":"float32","shape":[3,3,512,512]},{"name":"Model/U-Net/conv_middle/convolution_middle_2/bias","dtype":"float32","shape":[512]},{"name":"Model/U-Net/conv_transpose_3/up-convolution_3/bias","dtype":"float32","shape":[256]},{"name":"Model/U-Net/conv_transpose_3/convolution_3_1/kernel","dtype":"float32","shape":[3,3,512,256]},{"name":"Model/U-Net/conv_transpose_3/convolution_3_1/bias","dtype":"float32","shape":[256]},{"name":"Model/U-Net/conv_transpose_3/convolution_3_2/kernel","dtype":"float32","shape":[3,3,256,256]},{"name":"Model/U-Net/conv_transpose_3/convolution_3_2/bias","dtype":"float32","shape":[256]},{"name":"Model/U-Net/conv_transpose_2/up-convolution_2/bias","dtype":"float32","shape":[128]},{"name":"Model/U-Net/conv_transpose_2/convolution_2_1/kernel","dtype":"float32","shape":[3,3,256,128]},{"name":"Model/U-Net/conv_transpose_2/convolution_2_1/bias","dtype":"float32","shape":[128]},{"name":"Model/U-Net/conv_transpose_2/convolution_2_2/kernel","dtype":"float32","shape":[3,3,128,128]},{"name":"Model/U-Net/conv_transpose_2/convolution_2_2/bias","dtype":"float32","shape":[128]},{"name":"Model/U-Net/conv_transpose_1/up-convolution_1/bias","dtype":"float32","shape":[64]},{"name":"Model/U-Net/conv_transpose_3/concat_3/axis","dtype":"int32","shape":[]},{"name":"Model/U-Net/conv_transpose_1/convolution_1_1/kernel","dtype":"float32","shape":[3,3,128,64]},{"name":"Model/U-Net/conv_transpose_1/convolution_1_1/bias","dtype":"float32","shape":[64]},{"name":"Model/U-Net/conv_1/Pad/paddings","dtype":"int32","shape":[4,2]},{"name":"Model/U-Net/conv_transpose_1/convolution_1_2/kernel","dtype":"float32","shape":[3,3,64,64]},{"name":"Model/U-Net/conv_transpose_1/convolution_1_2/bias","dtype":"float32","shape":[64]},{"name":"Model/U-Net/deconv_final/convolution_1_final/kernel","dtype":"float32","shape":[1,1,64,2]},{"name":"Model/JS/Output/dimension","dtype":"int32","shape":[]},{"name":"ConstantFolding/Model/Inputs/stack_const_axis","dtype":"int32","shape":[]}],"paths":["group1-shard1of8","group1-shard2of8","group1-shard3of8","group1-shard4of8","group1-shard5of8","group1-shard6of8","group1-shard7of8","group1-shard8of8"]}]}