{"modelTopology":{"node":[{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"Model/Const","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":3}},"name":"Model/Slice/begin","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":3,"tensorShape":{"dim":[{"size":"4"}]}}},"dtype":{"type":3}},"name":"Model/Slice/size","op":"Const"},{"input":[],"attr":{"value":{"tensor":{"floatVal":[],"doubleVal":[],"intVal":[],"stringVal":[],"scomplexVal":[],"int64Val":[],"boolVal":[],"uint32Val":[],"uint64Val":[],"dtype":1,"tensorShape":{"dim":[]}}},"dtype":{"type":1}},"name":"Model/Const_1","op":"Const"},{"input":[],"attr":{"shape":{"shape":{"dim":[{"size":"-1"},{"size":"64"},{"size":"64"},{"size":"5"}]}},"dtype":{"type":1}},"name":"Placeholder","op":"Placeholder"},{"input":["Placeholder","Model/Slice/begin","Model/Slice/size"],"attr":{"Index":{"type":3},"T":{"type":1}},"name":"Model/Slice","op":"Slice"},{"input":["Model/Const","Model/Slice"],"attr":{"T":{"type":1}},"name":"Model/mul","op":"Mul"},{"input":["Model/mul","Model/Const_1"],"attr":{"T":{"type":1}},"name":"Model/add","op":"Add"},{"input":["Model/add"],"attr":{"T":{"type":1}},"name":"Model/add_1","op":"Identity"}],"library":{"function":[],"gradient":[]},"versions":{"badConsumers":[]}},"weightsManifest":[{"weights":[{"shape":[],"dtype":"float32","name":"Model/Const"},{"shape":[4],"dtype":"int32","name":"Model/Slice/begin"},{"shape":[4],"dtype":"int32","name":"Model/Slice/size"},{"shape":[],"dtype":"float32","name":"Model/Const_1"}],"paths":["group1-shard1of1"]}]}